# -*- coding: utf-8 -*-
=begin
  Copyright (C) 2011-2014 Takashi SUGA

  You may use and/or modify this file according to the license described in the LICENSE.txt file included in this archive.
=end

class When::TM::CalendarEra

  #
  # 皇紀
  #
  NihonKoki = [self, [
    "namespace:[ja=http://ja.wikipedia.org/wiki/, en=http://en.wikipedia.org/wiki/]",
    "locale:[=ja:, en=en:, alias]",
    "area:[日本]",
    ["[皇紀]1",		"@A",	"-659-01-01^JapaneseTwin::平朔儀鳳暦"],
    ["[皇紀]1113",	"@CR",	"0453-12-14^ChineseTwin::元嘉暦"],
    ["[皇紀]1253",	"",	"0593-01-01^Japanese"],
    ["[皇紀]2533",	"@CR",	"1873-01-01^Gregorian"]
  ]]

  #
  # 日本書紀暦日
  #
  NihonShoki = [self, [
    "namespace:[ja=http://ja.wikipedia.org/wiki/, en=http://en.wikipedia.org/wiki/]",
    "locale:[=ja:, en=en:, alias]",
    "period:[(日本書紀)=ja:%%<日本書紀>, (Nihon_Shoki)=en:Nihon_Shoki]",
    ["[神武]1",	"@A",	"name=[神武];-659-01-01^JapaneseTwin::平朔儀鳳暦"],
    ["[綏靖]1",	"@A",	"name=[綏靖];-580-01-08"],
    ["[安寧]0",	"@A",	"name=[安寧];-548-07-03"],
    ["[懿徳]1",	"@A",	"name=[懿徳];-509-02-04"],
    ["[孝昭]1",	"@A",	"name=[孝昭];-474-01-09"],
    ["[孝安]1",	"@A",	"name=[孝安];-391-01-07"],
    ["[孝霊]1",	"@A",	"name=[孝霊];-289-01-12"],
    ["[孝元]1",	"@A",	"name=[孝元];-213-01-14"],
    ["[開化]0",	"@A",	"name=[開化];-157-11-12"],
    ["[崇神]1",	"@A",	"name=[崇神];-096-01-13"],
    ["[垂仁]1",	"@A",	"name=[垂仁];-028-01-02"],
    ["[景行]1",	"@A",	"name=[景行];0071-07-11"],
    ["[成務]1",	"@A",	"name=[成務];0131-01-05"],
    ["[仲哀]1",	"@A",	"name=[仲哀];0192-01-11"],
    ["[神功皇后]0","@A","name=[神功皇后];0200-02-07"],
    ["[応神]1",	"@A",	"name=[応神];0270-01-01"],
    ["[仁徳]1",	"@A",	"name=[仁徳];0313-01-03"],
    ["[履中]1",	"@A",	"name=[履中];0400-02-01"],
    ["[反正]1",	"@A",	"name=[反正];0406-01-02"],
    ["[允恭]1",	"@A",	"name=[允恭];0412-12"],
    ["[安康]0",	"@A",	"name=[安康];0453-12-14^ChineseTwin::元嘉暦"],
    ["[雄略]0",	"@A",	"name=[雄略];0456-11-13"],
    ["[清寧]1",	"@A",	"name=[清寧];0480-01-15"],
    ["[顕宗]1",	"@A",	"name=[顕宗];0485-01-01"],
    ["[仁賢]1",	"@A",	"name=[仁賢];0488-01-05"],
    ["[武烈]0",	"@A",	"name=[武烈];0498-12"],
    ["[継体]1",	"@A",	"name=[継体];0507-02-04"],
    ["[安閑]1",	"@A",	"name=[安閑];0534"],
    ["[宣化]0",	"@A",	"name=[宣化];0535-12"],
    ["[欽明]0",	"@A",	"name=[欽明];0539-12-05"],
    ["[敏達]1",	"@A",	"name=[敏達];0572-04-03"],
    ["[用明]0",	"@A",	"name=[用明];0585-09-05"],
    ["[崇峻]0",	"@A",	"name=[崇峻];0587-08-02"],
    ["[推古]0",	"@A",	"name=[推古];0592-12-08"],
    ["[舒明]1",	"@A",	"name=[舒明];0629-01-04"],
    ["[皇極]1",	"@A",	"name=[皇極];0642-01-15"],
    ["[大化]1",	"@A",	"name=[孝徳];0645-06-19"],
    ["[白雉]1",	"@FE",	"	     0650-02-15"],
    ["[斉明]1",	"@A",	"name=[斉明];0655-01-03"],
    ["[天智]1",	"@A",	"name=[天智];0662-01-01"],
    ["[天武]1",	"@A",	"name=[天武];0672-01-01"],
    ["[朱鳥]1",	"",	"	     0686-07-20", "0687-01-01"]
  ]]
end
