# -*- coding: utf-8 -*-
=begin
  Copyright (C) 2013 Takashi SUGA

  You may use and/or modify this file according to the license described in the LICENSE.txt file included in this archive.
=end

require 'when_exe/region/chinese'
require 'when_exe/region/chinese/calendars'

#
#  王位年号一覧表
#
# （参考文献）
# 東洋史辞典（東京創元社）
# コンサイス世界年表（三省堂）
# 朝鮮史（山川出版社）
# 歴代紀元編（台湾中華書局）に引用される新唐書
#
module When
  class TM::CalendarEra

    #
    # 満洲
    #
    Manchurian = [self, [
      "locale:[=ja:, en=en:, alias]",
      "area:[満洲,Manchurian=en:Manchuria]",
      [self,
	"period:[震=ja:%%<渤海_(国)>]",
	["[高王=ja:%%<大祚栄>]1",	"@F",	"name=[高王=ja:%%<大祚栄>];698^Chinese0523", "713"]
      ],
      [self,
	"period:[渤海=ja:%%<渤海_(国)>,Balhae]",
	["[(高王)=ja:%%<大祚栄>]16",	"@A",	"name=[高王=ja:%%<大祚栄>];713^Chinese0523"],
	["[仁安=ja:%%<仁安_(渤海)>]0",	"@A",	"name=[武王=ja:%%<大武芸>];719"],		# コンサイスでは翌年が元年、以下翌年のものは(*)
	["[大興=ja:%%<大興_(渤海)>]1",	"@A",	"name=[文王=ja:%%<大欽茂>];738", "794"],
	["[宝暦=ja:%%<宝暦_(渤海)>]1",	"",	"774", "775"],		# Wikipedia
	["[(廃王)=ja:%%<大元義>]1",	"@A",	"name=[廃王=ja:%%<大元義>];794"],		# 朝鮮史では793?とする
	["[中興=ja:%%<中興_(渤海)>]1",	"@A",	"name=[成王=ja:%%<大華ヨ>];794"],		# 新唐書では786が元年？
	["[正暦=ja:%%<正暦_(渤海)>]1",	"@A",	"name=[康王=ja:%%<大嵩リン>];795"],
	["[永徳=ja:%%<永徳_(渤海)>]0",	"@A",	"name=[定王=ja:%%<大元瑜>];809"],		# コンサイスでは翌年が元年
	["[朱雀=ja:%%<朱雀_(渤海)>]1",	"@A",	"name=[僖王=ja:%%<大言義>];813"],		# 朝鮮史では817が末年		(*)
	["[太始=ja:%%<太始_(渤海)>]1",	"@A",	"name=[簡王=ja:%%<大明忠>];818"],		# 新唐書では前年が元年
	["[建興=ja:%%<建興_(渤海)>]0",	"@A",	"name=[宣王=ja:%%<大仁秀>];818"],		# コンサイスでは翌年が元年	(*)
	["[咸和=ja:%%<咸和_(渤海)>]0",	"@A", "name=[彝震王=ja:%%<大彝震>];830"], # （以後同様）		(*)
	["[(虔晃王)=ja:%%<大虔晃>]0","@A","name=[虔晃王=ja:%%<大虔晃>];857"], # 新唐書には以後記載なし (*)
	["[(景王)=ja:%%<大玄錫>]0",  "@A","name=[景王=ja:%%<大玄錫>];871"],   # 朝鮮史は871?	(*)
	["[(瑋瑎)=ja:%%<大イカイ>]0","@A","name=[瑋瑎=ja:%%<大イカイ>];894"], # 朝鮮史では在位不明 (*)
	["[(哀王)=ja:%%<大インセン>]0","@A","name=[哀王=ja:%%<大インセン>];906", #		(*)
	    "926="]
      ],
      [self,
	"period:[満洲国=ja:%%<満州国>]",
	["[大同=ja:%%<大同_(満州)>]1",	"@F",	"name=[溥儀=ja:%%<愛新覚羅溥儀>];1932-03-01^Gregorian?note=Chinese"],
	["[康徳]1.03.01","",		    "1934-03-01", "1945-08-18="]
      ],
    ]]

    #
    # 柔然
    #
    Rouran = [self, [
      "locale:[=ja:, en=en:, alias]",
      "area:[柔然,Rouran]",
      ["[永康=ja:%%<永康_(柔然)>]1",	"@A",	"name=[予成=ja:%%<郁久閭予成>];464^Chinese0445"],
      ["[太平=ja:%%<太平_(柔然)>]1",	"@A",	"name=[豆崙=ja:%%<郁久閭豆崙>];485"],
      ["[太安=ja:%%<太安_(柔然)>]1",	"@A",	"name=[那蓋=ja:%%<郁久閭那蓋>];492"],
      ["[始平]1",	"@A",	"name=[伏図=ja:%%<郁久閭伏図>];506"],
      ["[建昌=ja:%%<建昌_(柔然)>]1",	"@A",	"name=[醜奴=ja:%%<郁久閭醜奴>];508", "520="] # Wikipedia 509 -> 508
    ]]

    #
    # 高昌
    #
    Gaochang = [self, [
      "locale:[=ja:, en=en:, alias]",
      "area:[高昌,Gaochang]",
      ["[章和=ja:%%<章和_(高昌)>]1",	"@A",	  "name=[麹堅];531^Chinese0523"],
      ["[永平=ja:%%<永平_(高昌)>]1",	"@A",	"name=[麹玄喜];549"],
      ["[和平=ja:%%<和平_(高昌)>]1",	"@A",		"name=;551"],
      ["[建昌=ja:%%<建昌_(高昌)>]1",	"@A",	"name=[麹宝茂=zh:%%<麴寶茂>];555"],
      ["[延昌=ja:%%<延昌_(高昌)>]1",	"@A",	"name=[麹乾固=zh:%%<麴乾固>];561"],
      ["[延和=ja:%%<延和_(高昌)>]1",	"@A",	"name=[麹伯雅];602"],
      ["[義和=ja:%%<義和_(高昌)>]1",	"@A",		"name=;614"],
      ["[重光=ja:%%<重光_(高昌)>]1",	"",	"name=[麹伯雅];620"],
      ["[延寿=ja:%%<延寿_(高昌)>]1",	"@A",	"name=[麹文泰];624", "name=[麹智盛];640", "640="]
    ]]

    #
    # 雲南
    #
    Yunnan = [self, [
      "locale:[=ja:, en=en:, alias]",
      "area:[雲南,Yunnan]",
      [self,
	"period:[南詔,Nanzhao]",
	["[閣羅鳳=zh:%%<閣羅鳳>]1",	"@A", "name=[閣羅鳳=zh:%%<閣羅鳳>];748^Chinese0523"],
	["[賛普鍾=zh:%%<賛普鍾>]1",	"@A",   "name=[賛普鍾=zh:%%<賛普鍾>];752"],
	["[長寿=ja:%%<長寿_(南詔)>]1",	"",				    "769"],
	["[見龍]1",			"@A",	"name=[異牟尋=zh:%%<异牟寻>];780"],
	["[上元=ja:%%<上元_(南詔)>]1",	"",		    "784"],
	["[(上元)=ja:%%<上元_(南詔)>]2","", "785"],				   # 元封?
	["[応道]1",			"@A",	"name=[尋閣勧=zh:%%<寻阁劝>];809"],
	["[龍興=ja:%%<龍興_(南詔)>]1", "@A", "name=[勧龍晟=zh:%%<劝龙晟>];810"],
	["[全義]1",			"@A",	"name=[勧利晟=zh:%%<劝利晟>];817"],
	["[大豊=ja:%%<大豊_(南詔)>]1",	"",		    "820"],
	["[保和]1",			"@A",	"name=[晟豊祐=zh:%%<劝丰祐>];824"],
	["[(保和)=ja:%%<保和>, alias:天啓=ja:%%<天啓_(南詔)>]17", "",      "840"], # 天啓?
	["[建極]1",			"@A",	  "name=[世隆=zh:%%<世隆>];860"],
	["[(建極)=ja:%%<建極>, alias:法尭=ja:%%<法尭>]14","",	    "873", "877="] # 法尭?
      ],
      [self,
	"period:[大封民=zh:%%<南诏>#%.<改國號>]",
	["[貞明=ja:%%<貞明_(南詔)>]1",	"@F",	"name=[隆舜=zh:%%<隆舜>];878^Chinese0523"],
	["[(貞明)=ja:%%<貞明_(南詔)>]2","",		    "879"],	   # 承智, 大同?
	["[嵯耶]1",			"",		      "889"],
	["[中興=ja:%%<中興 (南詔)>]1",	"@A",	"name=[舜化貞=zh:%%<舜化貞>];897", "903"]
      ],
      [self,
	"period:[大長和=zh:%%<大長和>]",
	["[安国=ja:%%<安国_(南詔)>]1",	"@F",	"name=[鄭買嗣=zh:%%<鄭買嗣>];903^Chinese0523"],
	["[始元=ja:%%<始元_(南詔)>]1",	"@A",	"name=[鄭仁旻=zh:%%<鄭仁旻>];910"],
	["[(始元)=ja:%%<始元_(南詔)>]2",	"",		      "911"],		# 天瑞景星, 安和, 貞祐, 初暦, 孝治?
	["[天応=ja:%%<天応_(南詔)>]1",	"@A",	"name=[鄭隆亶=zh:%%<鄭隆亶>];927", "928"]
      ],
      [self,
	"period:[大天興=zh:%%<大天興>]",
	["[尊聖]1",	"@F",	"name=[趙善政=zh:%%<趙善政>];928^Chinese0523", "930"]
      ],
      [self,
	"period:[大義寧=zh:%%<大義寧>]",
	["[興聖=ja:%%<興聖_(南詔)>]1",	"@F",	"name=[楊干貞=zh:%%<楊干貞>];930^Chinese0523"],
	["[大明=zh:%%<大明_(大义宁)>]1",	"",		     "931", "938"]
      ],
      [self,
	"period:[大理,Dali]",
	["[文徳=ja:%%<文徳_(大理)>]1",	"@F",	"name=[段思平];0938^Chinese0523"],
	["[(文徳)=ja:%%<文徳_(大理)>]2","",		      "0939"],	# 神武?
	["[文経]1",			"@A",	"name=[段思英];0945"],
	["[至治=ja:%%<至治_(大理)>]1",	"@A",	"name=[段思良];0946", "0947^Chinese0956", ""],
	["[明徳=ja:%%<明徳_(大理)>]1",	"@A",	"name=[段思聡];0952"],
	["[(明徳)=ja:%%<明徳_(大理)>]2","",		      "0953"],	# 広徳?
	["[順徳=ja:%%<順徳_(大理)>]1",	"",		      "0968"],
	["[明政=ja:%%<明政_(大理)>]1",	"@A",	"name=[段素順];0969"],
	["[広明=ja:%%<広明_(大理)>]1",	"@A",	"name=[段素英];0986"],
	["[明応=ja:%%<明応_(大理)>]1",	"",		      "1005"],
	["[(明応)=ja:%%<明応_(大理)>]2","",		      "1006"],	# 明聖, 明徳, 明治?
	["[明啓]1",			"@A",	"name=[段素廉];1010"],
	["[乾興=ja:%%<乾興_(大理)>]1",	"",		      "1022"], # 李家瑞「用文物補正南詔及大理国的紀年」（『歴史研究』1958年第7期）from Wikipedia
	["[明通]1",			"@A",	"name=[段素隆];1023"],
	["[正治=ja:%%<正治_(大理)>]1",	"@A",	"name=[段素真];1027"],
	["[聖明=ja:%%<聖明_(大理)>]1",	"@A",	"name=[段素興];1042"],
	["[(聖明)=ja:%%<聖明_(大理)>]2","",		      "1043"],	# 天明?
	["[保安=ja:%%<保安_(大理)>]1",	"@A",	"name=[段思廉];1045"],
	["[正安=ja:%%<正安_(大理)>]1",	"",		      "1053"],
	["[(正安)=ja:%%<正安_(大理)>]4","",		      "1056"],	# 正徳(政徳), 保徳, 太安, 明侯?
	["[上徳]1","@A","name=[段連義, alias:段連義=ja:%%<段廉義>];1076"],
	["[広安=ja:%%<広安_(大理)>]1",	"",		      "1077"],
	["[上明]1",			"@A",	"name=[段寿輝];1081"],
	["[保立]1",			"@A",	"name=[段正明];1082"],
	["[(保立)=ja:%%<保立>]2",	"",		      "1083"],	# 建安, 天祐?
	["[上治]1",			"@A",	"name=[高昇泰];1095"],
	["[天授=ja:%%<天授_(大理)>]1",	"@A",	"name=[段正淳];1096"],
	["[開明=ja:%%<開明_(大理)>]1",	"",		      "1097"],
	["[天政, alias:天正=ja:%%<天政>]1",	"",	      "1103"],
	["[文安=ja:%%<文安_(大理)>]1",	"",		      "1105"],
	["[日新=ja:%%<日新_(大理)>]1",	"@A",	"name=[段正厳];1109"],
	["[文治=ja:%%<文治_(大理)>]1",	"",		      "1110"],
	["[(文治)=ja:%%<文治_(大理)>]10",	"",	      "1119"],	# 永嘉?
	["[保天]1",	"",				      "1129"],
	["[(保天)=ja:%%<保天>]9",	"",		      "1137"],	# 広運?
	["[永貞=ja:%%<永貞_(大理)>]1",	"@A",	"name=[段正興];1148"],
	["[大宝=ja:%%<大宝_(大理)>]1",	"",		      "1149"],
	["[(大宝)=ja:%%<大宝_(大理)>]8","",		      "1156"],	# 龍興, 盛明, 建徳?
	["[利貞]1",			"@A",	"name=[段智興];1172"],
	["[盛徳=ja:%%<盛徳_(大理)>]1",	"",		      "1176"],
	["[嘉会]1",			"",		      "1181"],
	["[元亨=ja:%%<元亨_(大理)>]1",	"",		      "1185"],
	["[(元亨)=ja:%%<元亨_(大理)>]12",	"",	      "1196"],	# 安定?
	["[鳳暦=ja:%%<鳳歴_(大理)>]1",	"@A",	"name=[段智廉];1201"],
	["[(鳳暦)=ja:%%<鳳歴_(大理)>]2",	"",	      "1202"],	# 元寿?
	["[天開=ja:%%<天開_(大理)>]1",	"@A",	"name=[段智祥];1205"],
	["[天輔=ja:%%<天輔_(大理)>]1",	"",		      "1226"],
	["[(天輔)=ja:%%<天輔_(大理)>]2","",		      "1227"],	# 仁寿?
	["[道隆]1",			"@A",	"name=[段祥興];1239"],
	["[天定=ja:%%<天定_(大理)>]1",	"@A",	"name=[段興智];1252", "1254="]
      ]
    ]]
  end
end
